# Площадь прямоугольного треугольника:
# Пользователь вводит длины катетов прямоугольного треугольника, а программа вычисляет и выводит его площадь.

katet1 = int(input('Введите длину первого катета:'))
katet2 = int(input('Введите длину второго катета:'))
S = katet1 * katet2 / 2
print('Площадь равна:', S)